72 77 512
83 71 513
64 77 514
81 68 515
64 81 516
68 81 517
513 324 518
512 326 519
78 84 520
78 77 521
82 83 522
78 81 523
68 77 524
78 333 525
64 75 526
64 83 527
68 337 528
72 83 529
72 333 530
83 334 531
81 78 532
72 338 533
75 68 534
72 66 535
64 339 536
514 323 537
68 323 538
78 325 539
66 71 540
78 337 541
68 338 542
72 75 543
68 75 544
82 339 545
64 66 546
78 76 547
64 76 548
75 78 549
64 333 550
64 344 551
82 71 552
81 72 553
75 72 554
83 72 555
69 541 556
77 68 557
172 253 558
81 64 559
71 64 560
67 68 561
78 75 562
85 324 563
82 72 564
84 81 565
64 331 566
82 68 567
6 338 568
84 77 569
67 72 570
65 68 571
75 64 572
86 71 573
78 78 574
67 551 575
68 333 576
76 64 577
77 78 578
75 324 579
83 78 580
520 337 581
72 81 582
70 71 583
86 529 584
72 339 585
88 78 586
64 82 587
82 79 588
513 533 589
83 338 590
527 72 591
586 340 592
584 327 593
64 67 594
72 82 595
64 65 596
75 344 597
86 68 598
513 68 599
83 68 600
64 338 601
64 70 602
85 72 603
79 79 604
82 84 605
71 78 606
76 344 607
13 13 608
65 84 609
66 547 610
82 324 611
517 338 612
76 68 613
76 324 614
526 331 615
66 521 616
76 78 617
74 324 618
70 68 619
520 339 620
524 339 621
66 78 622
69 68 623
85 517 624
64 337 625
69 532 626
64 84 627
79 78 628
66 324 629
583 339 630
516 324 631
82 338 632
626 332 633
66 327 634
83 81 635
520 77 636
521 324 637
65 344 638
67 78 639
83 327 640
86 523 641
517 324 642
74 68 643
79 532 644
69 523 645
67 338 646
65 78 647
83 64 648
86 324 649
70 78 650
71 68 651
83 528 652
512 70 653
67 324 654
65 324 655
591 525 656
76 523 657
64 88 658
68 87 659
543 331 660
79 68 661
74 338 662
82 66 663
75 84 664
69 84 665
80 84 666
85 528 667
558 246 668
73 84 669
76 84 670
527 324 671
514 67 672
85 68 673
74 519 674
76 516 675
78 79 676
71 72 677
608 269 678
79 515 679
64 323 680
81 84 681
513 536 682
73 78 683
78 69 684
66 68 685
557 342 686
64 332 687
64 79 688
70 515 689
82 82 690
67 84 691
578 342 692
88 68 693
83 519 694
88 581 695
529 344 696
77 72 697
66 72 698
79 516 699
70 84 700
69 72 701
64 69 702
79 517 703
83 517 704
84 335 705
82 334 706
70 72 707
521 338 708
70 81 709
70 324 710
65 81 711
79 75 712
6 339 713
76 72 714
512 324 715
598 68 716
65 72 717
84 338 718
552 78 719
560 563 720
580 575 721
64 85 722
76 514 723
524 83 724
546 330 725
565 324 726
520 81 727
158 222 728
66 84 729
75 323 730
549 78 731
72 76 732
535 324 733
82 547 734
69 512 735
515 323 736
515 77 737
574 323 738
86 601 739
555 525 740
79 72 741
72 337 742
513 528 743
83 344 744
79 71 745
516 323 746
68 66 747
0 256 748
76 521 749
657 324 750
86 660 751
83 559 752
66 550 753
66 562 754
79 84 755
83 324 756
86 333 757
76 65 758
82 78 759
529 72 760
669 545 761
77 519 762
71 642 763
83 84 764
79 64 765
79 81 766
609 339 767
573 536 768
526 597 769
69 582 770
76 512 771
66 64 772
514 339 773
82 64 774
83 538 775
68 85 776
76 621 777
69 64 778
619 339 779
548 324 780
596 620 781
70 559 782
578 339 783
560 604 784
658 338 785
76 550 786
71 533 787
555 614 788
554 618 789
70 327 790
560 338 791
513 514 792
549 563 793
516 339 794
522 68 795
67 519 796
71 324 797
66 515 798
86 338 799
86 527 800
67 528 801
529 324 802
82 517 803
546 324 804
602 324 805
524 323 806
522 81 807
64 86 808
522 523 809
81 324 810
66 516 811
544 331 812
526 75 813
79 338 814
69 553 815
79 606 816
79 523 817
67 334 818
64 74 819
86 72 820
69 515 821
573 334 822
552 72 823
65 574 824
82 525 825
544 75 826
573 576 827
543 75 828
606 342 829
689 536 830
86 512 831
68 331 832
65 75 833
82 564 834
526 72 835
734 324 836
558 240 837
83 521 838
67 517 839
534 338 840
79 572 841
171 116 842
68 67 843
82 540 844
71 84 845
521 326 846
67 525 847
74 72 848
82 327 849
514 77 850
66 523 851
13 269 852
636 323 853
64 89 854
512 68 855
516 344 856
665 331 857
522 84 858
520 730 859
522 72 860
70 334 861
567 324 862
596 579 863
516 338 864
75 331 865
76 595 866
65 517 867
66 330 868
86 64 869
524 590 870
77 334 871
564 70 872
69 324 873
770 545 874
68 339 875
588 68 876
546 74 877
72 325 878
520 338 879
6 332 880
522 528 881
64 604 882
514 70 883
514 629 884
514 338 885
70 738 886
65 515 887
68 624 888
599 344 889
83 535 890
610 324 891
684 69 892
65 725 893
587 324 894
653 338 895
562 323 896
72 630 897
69 78 898
71 528 899
784 344 900
79 535 901
529 338 902
85 519 903
84 82 904
76 527 905
71 547 906
67 344 907
68 76 908
82 74 909
88 519 910
599 742 911
534 323 912
81 344 913
84 75 914
71 516 915
66 74 916
83 525 917
521 566 918
71 544 919
81 535 920
65 582 921
603 68 922
86 551 923
83 553 924
67 64 925
79 534 926
65 532 927
522 78 928
574 331 929
697 630 930
635 84 931
65 64 932
515 594 933
515 338 934
693 625 935
69 81 936
83 523 937
526 338 938
66 636 939
66 572 940
83 726 941
85 544 942
527 538 943
534 66 944
524 67 945
513 519 946
85 78 947
535 72 948
571 545 949
66 514 950
641 330 951
572 545 952
702 652 953
524 629 954
79 553 955
79 324 956
68 82 957
72 331 958
728 355 959
67 515 960
88 338 961
78 667 962
72 542 963
558 239 964
610 76 965
83 86 966
512 330 967
82 569 968
66 75 969
554 873 970
83 83 971
64 540 972
75 537 973
82 88 974
83 515 975
83 526 976
79 562 977
82 76 978
691 66 979
82 526 980
69 339 981
6 810 982
540 68 983
86 516 984
83 565 985
591 708 986
546 327 987
76 338 988
543 324 989
79 332 990
520 790 991
527 68 992
522 516 993
716 330 994
0 748 995
66 664 996
513 642 997
77 528 998
83 547 999
82 544 1000
842 493 1001
641 730 1002
85 542 1003
66 548 1004
650 339 1005
512 704 1006
684 325 1007
84 332 1008
838 897 1009
78 743 1010
71 520 1011
731 330 1012
73 68 1013
72 323 1014
564 525 1015
571 627 1016
527 83 1017
544 72 1018
523 339 1019
515 66 1020
69 69 1021
522 517 1022
605 604 1023
70 524 1024
571 576 1025
543 344 1026
600 687 1027
76 76 1028
72 322 1029
661 676 1030
529 83 1031
527 338 1032
521 597 1033
758 528 1034
524 70 1035
65 553 1036
76 79 1037
74 692 1038
65 565 1039
65 516 1040
512 338 1041
549 342 1042
552 324 1043
532 342 1044
158 251 1045
83 532 1046
1030 579 1047
603 320 1048
549 86 1049
602 64 1050
571 83 1051
87 339 1052
69 546 1053
540 516 1054
68 516 1055
86 526 1056
82 524 1057
69 548 1058
65 579 1059
77 591 1060
595 327 1061
77 523 1062
70 780 1063
554 563 1064
82 622 1065
534 344 1066
67 521 1067
535 330 1068
65 615 1069
624 344 1070
599 611 1071
79 514 1072
72 320 1073
527 519 1074
66 81 1075
64 515 1076
70 582 1077
577 618 1078
522 515 1079
719 342 1080
13 257 1081
69 75 1082
84 79 1083
67 81 1084
792 662 1085
543 554 1086
86 547 1087
522 338 1088
72 70 1089
82 565 1090
888 88 1091
66 565 1092
922 342 1093
534 339 1094
512 531 1095
617 545 1096
77 64 1097
512 570 1098
70 516 1099
560 323 1100
82 520 1101
85 538 1102
514 83 1103
760 525 1104
577 654 1105
69 562 1106
569 72 1107
529 538 1108
558 237 1109
535 566 1110
513 81 1111
933 344 1112
540 747 1113
67 559 1114
74 542 1115
824 330 1116
68 335 1117
564 322 1118
657 762 1119
557 799 1120
66 627 1121
66 339 1122
86 812 1123
514 66 1124
816 531 1125
513 550 1126
523 338 1127
921 513 1128
70 70 1129
520 83 1130
557 1052 1131
734 68 1132
524 519 1133
809 344 1134
540 553 1135
639 757 1136
906 324 1137
69 623 1138
821 324 1139
67 320 1140
65 523 1141
69 543 1142
698 566 1143
792 330 1144
564 654 1145
534 516 1146
666 68 1147
75 715 1148
83 524 1149
527 542 1150
693 864 1151
76 88 1152
816 580 1153
1016 555 1154
553 630 1155
77 84 1156
645 76 1157
823 335 1158
65 514 1159
513 517 1160
67 785 1161
70 548 1162
587 525 1163
70 344 1164
558 236 1165
1128 575 1166
567 339 1167
535 74 1168
68 83 1169
522 660 1170
610 519 1171
648 618 1172
558 229 1173
65 65 1174
82 562 1175
82 521 1176
67 524 1177
68 79 1178
670 1118 1179
599 332 1180
561 333 1181
573 344 1182
69 574 1183
66 559 1184
548 854 1185
86 77 1186
71 562 1187
83 694 1188
86 81 1189
84 324 1190
577 70 1191
66 532 1192
75 514 1193
66 549 1194
65 559 1195
64 330 1196
82 519 1197
66 526 1198
515 680 1199
6 563 1200
683 71 1201
65 596 1202
67 553 1203
65 549 1204
717 326 1205
517 535 1206
512 339 1207
83 541 1208
635 344 1209
75 320 1210
534 70 1211
1011 611 1212
76 535 1213
85 526 1214
1154 857 1215
75 1031 1216
1113 330 1217
557 86 1218
624 82 1219
82 86 1220
516 72 1221
841 88 1222
71 517 1223
728 497 1224
86 530 1225
76 320 1226
616 709 1227
844 929 1228
69 569 1229
13 287 1230
651 526 1231
535 327 1232
67 544 1233
573 642 1234
75 521 1235
643 339 1236
966 334 1237
670 634 1238
800 634 1239
85 524 1240
67 538 1241
64 545 1242
74 538 1243
65 587 1244
650 519 1245
76 335 1246
68 667 1247
86 785 1248
532 78 1249
561 872 1250
75 88 1251
82 538 1252
580 335 1253
75 512 1254
540 514 1255
580 334 1256
529 519 1257
67 621 1258
583 590 1259
83 88 1260
588 78 1261
557 538 1262
65 664 1263
512 522 1264
571 519 1265
1045 97 1266
86 544 1267
75 338 1268
677 332 1269
76 551 1270
522 519 1271
77 320 1272
544 344 1273
1216 579 1274
70 64 1275
77 527 1276
999 523 1277
76 66 1278
71 521 1279
86 773 1280
64 582 1281
741 322 1282
548 1206 1283
79 528 1284
534 632 1285
716 74 1286
673 331 1287
64 327 1288
66 688 1289
540 548 1290
70 517 1291
555 76 1292
1277 1044 1293
557 632 1294
522 671 1295
71 526 1296
803 85 1297
89 324 1298
78 338 1299
79 527 1300
85 595 1301
659 66 1302
82 512 1303
69 325 1304
66 696 1305
66 524 1306
514 88 1307
65 544 1308
605 1028 1309
83 512 1310
86 859 1311
731 674 1312
74 78 1313
685 534 1314
1058 1026 1315
76 517 1316
628 86 1317
919 335 1318
609 82 1319
66 334 1320
66 534 1321
1000 325 1322
524 338 1323
535 338 1324
513 78 1325
514 72 1326
540 78 1327
534 594 1328
65 338 1329
83 716 1330
513 967 1331
645 324 1332
540 543 1333
603 561 1334
570 323 1335
526 324 1336
540 72 1337
85 543 1338
524 646 1339
86 519 1340
79 587 1341
6 865 1342
85 562 1343
82 320 1344
70 338 1345
723 344 1346
73 747 1347
571 1332 1348
782 745 1349
77 344 1350
565 519 1351
86 543 1352
67 67 1353
609 543 1354
69 722 1355
522 538 1356
635 514 1357
75 519 1358
520 323 1359
67 710 1360
701 544 1361
1060 918 1362
522 64 1363
66 517 1364
86 642 1365
512 320 1366
567 1163 1367
66 520 1368
77 538 1369
1185 519 1370
555 708 1371
1314 711 1372
77 338 1373
64 513 1374
651 680 1375
82 575 1376
67 516 1377
549 66 1378
85 512 1379
514 1010 1380
70 574 1381
82 527 1382
77 88 1383
683 530 1384
679 82 1385
82 542 1386
82 653 1387
514 320 1388
512 519 1389
608 852 1390
66 727 1391
842 237 1392
546 339 1393
1121 611 1394
554 630 1395
548 338 1396
83 320 1397
65 526 1398
69 322 1399
677 790 1400
892 948 1401
83 339 1402
1135 522 1403
67 535 1404
67 658 1405
559 331 1406
71 523 1407
25 264 1408
603 564 1409
77 548 1410
78 65 1411
577 338 1412
583 83 1413
515 769 1414
83 569 1415
735 323 1416
1111 991 1417
817 339 1418
84 83 1419
555 563 1420
522 88 1421
77 324 1422
523 324 1423
668 224 1424
1023 1019 1425
557 667 1426
776 576 1427
558 242 1428
71 320 1429
88 320 1430
75 67 1431
84 330 1432
81 514 1433
73 548 1434
820 513 1435
613 570 1436
67 542 1437
557 344 1438
540 519 1439
526 68 1440
71 88 1441
74 512 1442
0 0 1443
67 88 1444
712 804 1445
526 706 1446
65 534 1447
573 1232 1448
833 725 1449
65 554 1450
82 551 1451
699 330 1452
712 551 1453
582 324 1454
1334 334 1455
1286 806 1456
64 543 1457
643 344 1458
79 339 1459
86 746 1460
815 575 1461
67 512 1462
855 632 1463
70 532 1464
65 524 1465
526 1248 1466
83 1069 1467
602 334 1468
76 543 1469
66 88 1470
644 979 1471
570 663 1472
569 839 1473
926 894 1474
588 523 1475
665 865 1476
68 344 1477
558 247 1478
595 324 1479
760 542 1480
66 527 1481
74 578 1482
84 611 1483
898 515 1484
74 528 1485
516 83 1486
677 583 1487
676 576 1488
82 514 1489
68 69 1490
727 338 1491
552 538 1492
522 553 1493
67 532 1494
1050 530 1495
72 332 1496
558 241 1497
524 683 1498
665 333 1499
619 1188 1500
79 524 1501
70 528 1502
66 554 1503
514 344 1504
888 344 1505
68 84 1506
1087 576 1507
158 250 1508
68 545 1509
66 859 1510
81 88 1511
1 287 1512
513 520 1513
552 64 1514
965 569 1515
65 528 1516
67 870 1517
570 82 1518
573 989 1519
808 551 1520
570 334 1521
71 548 1522
70 572 1523
67 671 1524
74 320 1525
866 338 1526
569 634 1527
86 521 1528
512 69 1529
1249 332 1530
70 320 1531
515 566 1532
659 703 1533
570 1020 1534
552 859 1535
588 81 1536
70 562 1537
75 846 1538
1051 652 1539
523 72 1540
68 88 1541
72 954 1542
543 338 1543
89 89 1544
71 514 1545
69 853 1546
85 338 1547
158 247 1548
628 545 1549
555 322 1550
699 339 1551
76 524 1552
737 629 1553
685 632 1554
85 535 1555
82 543 1556
719 335 1557
668 480 1558
69 738 1559
85 566 1560
860 322 1561
88 520 1562
82 785 1563
68 944 1564
522 625 1565
78 66 1566
75 672 1567
72 67 1568
66 740 1569
1361 323 1570
82 684 1571
522 794 1572
800 528 1573
815 1339 1574
521 542 1575
558 234 1576
69 572 1577
69 516 1578
573 802 1579
699 744 1580
512 545 1581
709 520 1582
83 341 1583
1091 637 1584
76 724 1585
73 64 1586
540 64 1587
766 512 1588
514 590 1589
67 1351 1590
75 527 1591
75 516 1592
598 545 1593
513 576 1594
74 64 1595
88 636 1596
512 588 1597
512 600 1598
598 576 1599
1409 339 1600
1050 1581 1601
515 534 1602
651 594 1603
66 542 1604
580 757 1605
731 662 1606
513 515 1607
515 707 1608
737 339 1609
644 1347 1610
1077 331 1611
567 516 1612
86 78 1613
76 547 1614
66 625 1615
71 569 1616
755 1450 1617
67 328 1618
79 579 1619
66 615 1620
66 553 1621
84 76 1622
645 323 1623
703 623 1624
815 806 1625
71 746 1626
834 525 1627
600 545 1628
841 910 1629
516 853 1630
571 1394 1631
643 590 1632
613 875 1633
1382 565 1634
516 555 1635
641 74 1636
73 569 1637
85 576 1638
81 569 1639
613 1034 1640
817 83 1641
605 703 1642
83 584 1643
82 548 1644
544 338 1645
83 597 1646
594 85 1647
591 563 1648
527 327 1649
82 726 1650
722 1457 1651
572 337 1652
82 666 1653
516 646 1654
776 621 1655
76 576 1656
75 75 1657
78 624 1658
549 1164 1659
529 566 1660
1292 542 1661
76 526 1662
65 877 1663
66 574 1664
577 674 1665
522 681 1666
158 223 1667
529 84 1668
552 516 1669
70 550 1670
66 587 1671
82 77 1672
1309 528 1673
901 941 1674
69 514 1675
71 512 1676
1403 1412 1677
66 344 1678
766 1359 1679
1290 741 1680
1250 333 1681
604 519 1682
606 956 1683
66 320 1684
1651 863 1685
577 88 1686
598 67 1687
1153 1349 1688
876 1143 1689
980 324 1690
928 335 1691
517 344 1692
64 598 1693
526 696 1694
677 1134 1695
548 320 1696
679 564 1697
65 681 1698
641 674 1699
67 637 1700
67 337 1701
74 576 1702
623 527 1703
86 738 1704
992 545 1705
968 575 1706
617 603 1707
942 344 1708
82 534 1709
69 804 1710
588 747 1711
858 1517 1712
65 88 1713
560 332 1714
588 521 1715
1319 1463 1716
67 527 1717
72 324 1718
72 79 1719
759 698 1720
70 549 1721
71 672 1722
515 851 1723
81 338 1724
613 68 1725
643 1117 1726
79 565 1727
1231 640 1728
552 68 1729
610 926 1730
650 323 1731
925 603 1732
754 944 1733
554 522 1734
81 320 1735
996 321 1736
83 612 1737
512 996 1738
513 895 1739
712 514 1740
158 246 1741
1201 333 1742
552 519 1743
527 914 1744
759 525 1745
1263 324 1746
70 523 1747
1634 575 1748
86 525 1749
1227 1744 1750
567 68 1751
1266 1001 1752
1325 611 1753
668 491 1754
735 566 1755
67 520 1756
529 327 1757
78 757 1758
532 680 1759
83 581 1760
64 522 1761
1098 320 1762
555 331 1763
77 323 1764
69 517 1765
1355 523 1766
605 75 1767
1146 333 1768
770 324 1769
669 522 1770
1582 335 1771
64 71 1772
81 546 1773
647 907 1774
84 337 1775
66 631 1776
156 116 1777
79 549 1778
78 327 1779
628 82 1780
707 563 1781
600 540 1782
605 65 1783
66 724 1784
517 519 1785
88 76 1786
543 696 1787
69 535 1788
1235 847 1789
85 582 1790
700 961 1791
65 320 1792
558 97 1793
1202 344 1794
663 515 1795
668 235 1796
931 1246 1797
569 801 1798
1255 710 1799
72 550 1800
754 534 1801
690 542 1802
75 528 1803
690 538 1804
77 733 1805
850 636 1806
1317 528 1807
82 516 1808
64 674 1809
771 72 1810
82 554 1811
82 716 1812
74 516 1813
665 75 1814
66 681 1815
546 740 1816
64 743 1817
8 269 1818
522 672 1819
561 942 1820
64 64 1821
70 514 1822
534 981 1823
549 331 1824
515 75 1825
1357 82 1826
76 870 1827
512 83 1828
68 325 1829
723 602 1830
570 70 1831
1024 517 1832
639 1186 1833
79 627 1834
555 85 1835
74 84 1836
513 565 1837
74 524 1838
522 525 1839
69 885 1840
976 330 1841
1330 339 1842
83 574 1843
1421 579 1844
644 600 1845
567 616 1846
936 521 1847
1693 836 1848
70 75 1849
79 526 1850
557 83 1851
82 523 1852
572 84 1853
70 521 1854
1303 629 1855
83 744 1856
803 963 1857
613 657 1858
65 1018 1859
1142 332 1860
570 67 1861
570 542 1862
78 83 1863
1750 986 1864
79 559 1865
68 563 1866
86 574 1867
1401 566 1868
605 66 1869
512 798 1870
65 521 1871
699 83 1872
604 538 1873
940 632 1874
564 563 1875
647 344 1876
729 75 1877
1624 1122 1878
83 520 1879
67 548 1880
1267 891 1881
1183 1467 1882
71 328 1883
79 688 1884
869 585 1885
594 320 1886
1227 1032 1887
1596 326 1888
1302 1108 1889
515 685 1890
73 514 1891
85 320 1892
515 67 1893
522 559 1894
1436 320 1895
6 323 1896
639 542 1897
534 83 1898
670 75 1899
828 338 1900
689 576 1901
76 544 1902
580 619 1903
665 941 1904
693 1022 1905
1219 696 1906
645 332 1907
648 530 1908
72 561 1909
540 542 1910
848 646 1911
666 72 1912
560 560 1913
561 648 1914
717 70 1915
1766 802 1916
1077 1268 1917
616 1310 1918
639 332 1919
1612 634 1920
84 566 1921
64 742 1922
67 612 1923
749 640 1924
66 528 1925
1905 575 1926
1515 696 1927
594 324 1928
639 326 1929
1338 579 1930
535 542 1931
67 1018 1932
974 795 1933
681 333 1934
595 332 1935
651 794 1936
66 705 1937
524 555 1938
623 342 1939
1697 1258 1940
68 646 1941
569 1763 1942
623 860 1943
78 74 1944
69 549 1945
774 1014 1946
562 324 1947
613 67 1948
752 1287 1949
126 352 1950
745 637 1951
1903 743 1952
778 545 1953
549 339 1954
1162 542 1955
552 582 1956
1051 1599 1957
88 542 1958
513 612 1959
639 519 1960
76 546 1961
527 541 1962
65 537 1963
1106 1049 1964
1610 339 1965
1820 676 1966
570 1138 1967
616 623 1968
876 698 1969
772 545 1970
88 82 1971
647 746 1972
81 323 1973
72 566 1974
552 574 1975
81 548 1976
560 903 1977
552 631 1978
1106 1042 1979
521 68 1980
77 780 1981
76 337 1982
755 339 1983
1472 84 1984
523 344 1985
66 780 1986
520 82 1987
82 802 1988
1643 652 1989
83 65 1990
83 529 1991
735 769 1992
89 538 1993
605 1284 1994
610 1072 1995
904 519 1996
813 338 1997
554 545 1998
81 533 1999
719 339 2000
70 526 2001
83 516 2002
561 331 2003
1201 77 2004
728 498 2005
1132 946 2006
559 332 2007
1598 515 2008
573 68 2009
65 585 2010
558 235 2011
1079 875 2012
636 67 2013
64 72 2014
890 1632 2015
1707 324 2016
515 526 2017
74 88 2018
648 674 2019
78 604 2020
66 322 2021
75 548 2022
76 636 2023
512 673 2024
833 877 2025
904 538 2026
521 1148 2027
88 523 2028
1378 566 2029
700 68 2030
66 662 2031
78 86 2032
619 545 2033
647 961 2034
1086 525 2035
616 83 2036
515 698 2037
512 538 2038
1506 532 2039
578 86 2040
567 576 2041
79 327 2042
600 972 2043
561 69 2044
1101 640 2045
605 634 2046
808 746 2047
670 545 2048
595 605 2049
772 515 2050
623 832 2051
79 664 2052
75 1705 2053
1475 590 2054
598 65 2055
600 87 2056
68 777 2057
82 330 2058
701 322 2059
86 514 2060
600 634 2061
78 339 2062
647 343 2063
77 517 2064
821 68 2065
83 566 2066
64 552 2067
66 894 2068
606 339 2069
1528 839 2070
1725 694 2071
517 320 2072
540 813 2073
558 238 2074
683 321 2075
543 72 2076
66 929 2077
73 727 2078
513 338 2079
76 334 2080
69 544 2081
570 324 2082
1213 560 2083
68 534 2084
600 548 2085
1297 733 2086
522 537 2087
577 1115 2088
79 519 2089
1055 597 2090
610 542 2091
68 330 2092
606 554 2093
85 612 2094
602 1190 2095
82 627 2096
1607 324 2097
749 575 2098
778 823 2099
1132 637 2100
513 532 2101
567 320 2102
65 680 2103
1023 523 2104
985 333 2105
565 344 2106
76 519 2107
1688 344 2108
77 535 2109
675 330 2110
679 1856 2111
690 519 2112
800 1439 2113
613 758 2114
516 553 2115
939 744 2116
571 987 2117
936 514 2118
1306 652 2119
977 733 2120
65 527 2121
1617 322 2122
83 514 2123
679 632 2124
82 702 2125
82 344 2126
619 590 2127
532 88 2128
77 612 2129
88 727 2130
609 344 2131
522 612 2132
719 86 2133
587 538 2134
1333 960 2135
702 920 2136
512 542 2137
588 804 2138
663 553 2139
71 615 2140
765 512 2141
516 519 2142
906 68 2143
76 565 2144
1231 513 2145
540 538 2146
82 672 2147
1890 72 2148
700 344 2149
68 64 2150
1283 550 2151
515 564 2152
2135 333 2153
12 12 2154
72 553 2155
653 917 2156
939 1209 2157
532 632 2158
534 333 2159
850 320 2160
824 662 2161
65 322 2162
68 629 2163
67 547 2164
549 1708 2165
74 71 2166
661 83 2167
70 88 2168
70 553 2169
522 805 2170
892 733 2171
532 868 2172
76 525 2173
65 551 2174
83 863 2175
605 333 2176
76 538 2177
513 512 2178
75 523 2179
69 1049 2180
7 287 2181
1107 1906 2182
809 324 2183
1847 339 2184
1381 67 2185
89 320 2186
947 756 2187
1062 640 2188
651 344 2189
514 732 2190
523 801 2191
714 67 2192
1435 620 2193
64 561 2194
515 1640 2195
675 1236 2196
30 286 2197
670 82 2198
752 1389 2199
68 979 2200
609 83 2201
622 667 2202
522 514 2203
663 524 2204
65 572 2205
887 819 2206
75 520 2207
82 780 2208
70 896 2209
64 530 2210
78 82 2211
647 640 2212
75 529 2213
624 77 2214
64 328 2215
526 609 2216
79 320 2217
1498 344 2218
571 70 2219
826 519 2220
1837 1376 2221
1529 334 2222
82 550 2223
1283 320 2224
560 742 2225
600 331 2226
675 634 2227
616 1364 2228
1801 710 2229
1968 1553 2230
688 335 2231
71 581 2232
540 883 2233
158 248 2234
82 727 2235
562 338 2236
598 1817 2237
86 625 2238
79 677 2239
1943 1560 2240
1846 323 2241
729 756 2242
766 546 2243
524 517 2244
807 344 2245
534 64 2246
977 529 2247
82 722 2248
567 333 2249
78 342 2250
76 328 2251
557 625 2252
520 630 2253
89 68 2254
622 1138 2255
86 1086 2256
67 514 2257
567 344 2258
1732 323 2259
68 611 2260
69 550 2261
561 698 2262
599 527 2263
578 85 2264
591 521 2265
635 546 2266
663 72 2267
515 1093 2268
66 544 2269
68 332 2270
84 333 2271
669 597 2272
523 1089 2273
555 521 2274
67 681 2275
1157 528 2276
522 551 2277
702 704 2278
512 85 2279
1843 330 2280
1717 320 2281
65 566 2282
764 957 2283
67 550 2284
776 1133 2285
1424 1424 2286
67 562 2287
84 934 2288
644 603 2289
83 82 2290
68 522 2291
872 333 2292
73 546 2293
84 74 2294
82 846 2295
693 339 2296
647 86 2297
512 691 2298
73 688 2299
71 574 2300
628 1207 2301
1307 637 2302
89 344 2303
72 545 2304
71 565 2305
529 526 2306
1354 796 2307
1087 550 2308
540 565 2309
73 517 2310
703 645 2311
622 987 2312
534 2095 2313
685 690 2314
557 339 2315
72 1191 2316
1060 521 2317
711 529 2318
666 324 2319
808 1654 2320
602 542 2321
641 662 2322
66 538 2323
723 629 2324
75 671 2325
1089 333 2326
749 1477 2327
931 324 2328
72 328 2329
83 812 2330
712 546 2331
79 546 2332
587 344 2333
641 1431 2334
571 1676 2335
732 1641 2336
933 519 2337
782 332 2338
707 903 2339
613 339 2340
71 585 2341
645 1460 2342
522 547 2343
1385 724 2344
1637 324 2345
759 1143 2346
578 525 2347
675 83 2348
1296 325 2349
82 598 2350
650 2214 2351
74 517 2352
1914 1543 2353
554 849 2354
62 62 2355
546 344 2356
564 320 2357
867 339 2358
69 615 2359
0 995 2360
8 267 2361
513 72 2362
67 760 2363
588 1019 2364
74 653 2365
69 529 2366
522 702 2367
66 536 2368
670 567 2369
1306 635 2370
88 528 2371
616 1046 2372
65 731 2373
1056 330 2374
546 764 2375
1861 333 2376
554 76 2377
1146 762 2378
515 1920 2379
1687 557 2380
627 513 2381
71 1491 2382
74 344 2383
69 625 2384
71 524 2385
608 608 2386
529 540 2387
553 331 2388
807 846 2389
909 344 2390
1147 860 2391
1434 542 2392
81 521 2393
67 70 2394
69 565 2395
66 512 2396
639 957 2397
882 532 2398
675 643 2399
764 934 2400
1814 597 2401
540 536 2402
2335 323 2403
600 76 2404
735 72 2405
866 1015 2406
65 1017 2407
623 544 2408
651 722 2409
1091 946 2410
65 625 2411
86 1061 2412
679 714 2413
72 577 2414
1533 1542 2415
68 987 2416
515 1418 2417
1812 339 2418
890 338 2419
1536 519 2420
515 1715 2421
1933 332 2422
1555 937 2423
75 530 2424
774 342 2425
526 1112 2426
583 652 2427
69 534 2428
159 225 2429
711 519 2430
2216 332 2431
12 268 2432
826 338 2433
522 550 2434
580 332 2435
1006 1362 2436
86 621 2437
514 697 2438
905 634 2439
604 528 2440
522 637 2441
978 615 2442
559 530 2443
2099 525 2444
1076 320 2445
85 514 2446
602 2007 2447
74 334 2448
1513 630 2449
641 640 2450
85 550 2451
76 528 2452
2255 324 2453
529 542 2454
70 77 2455
1635 545 2456
66 525 2457
516 540 2458
66 582 2459
567 798 2460
709 853 2461
595 78 2462
71 537 2463
622 332 2464
1036 1360 2465
71 338 2466
87 72 2467
75 967 2468
755 75 2469
588 75 2470
81 804 2471
69 554 2472
553 667 2473
70 601 2474
570 1065 2475
67 526 2476
1222 528 2477
69 585 2478
1153 338 2479
529 88 2480
78 330 2481
73 523 2482
635 320 2483
688 2388 2484
594 338 2485
64 570 2486
1175 84 2487
1016 744 2488
639 541 2489
613 690 2490
1083 1524 2491
835 320 2492
844 78 2493
524 538 2494
1614 621 2495
1065 83 2496
663 1542 2497
72 541 2498
555 542 2499
546 2158 2500
1987 597 2501
552 542 2502
2397 333 2503
79 805 2504
800 517 2505
76 2035 2506
940 834 2507
75 535 2508
772 522 2509
1157 656 2510
2083 832 2511
826 334 2512
82 617 2513
512 590 2514
603 1015 2515
676 1133 2516
1431 333 2517
627 807 2518
2283 575 2519
831 998 2520
628 834 2521
81 853 2522
1956 339 2523
570 339 2524
65 334 2525
84 542 2526
543 912 2527
526 846 2528
924 335 2529
993 694 2530
732 644 2531
74 514 2532
703 825 2533
578 83 2534
515 622 2535
557 1941 2536
66 579 2537
554 324 2538
515 545 2539
81 519 2540
831 652 2541
564 1037 2542
617 332 2543
571 528 2544
1053 68 2545
937 338 2546
904 320 2547
1733 740 2548
619 523 2549
567 1627 2550
635 910 2551
572 338 2552
572 618 2553
73 524 2554
2273 512 2555
858 1258 2556
567 1092 2557
85 530 2558
901 338 2559
659 661 2560
610 79 2561
1854 1272 2562
68 666 2563
65 594 2564
534 88 2565
64 340 2566
2114 612 2567
887 1196 2568
86 615 2569
707 322 2570
1462 998 2571
609 75 2572
1597 582 2573
81 328 2574
771 323 2575
535 320 2576
831 762 2577
976 674 2578
83 737 2579
82 533 2580
83 576 2581
2070 857 2582
82 692 2583
651 625 2584
513 547 2585
578 946 2586
700 72 2587
522 512 2588
1204 326 2589
623 545 2590
65 569 2591
534 324 2592
984 646 2593
540 884 2594
960 632 2595
515 333 2596
1834 331 2597
79 542 2598
1782 578 2599
681 834 2600
66 746 2601
68 1242 2602
675 72 2603
86 715 2604
83 328 2605
572 342 2606
807 535 2607
74 328 2608
688 324 2609
627 700 2610
644 623 2611
587 327 2612
1391 611 2613
577 958 2614
737 1646 2615
67 569 2616
76 569 2617
549 673 2618
595 973 2619
1203 563 2620
82 75 2621
945 538 2622
577 530 2623
549 545 2624
1276 726 2625
1266 1392 2626
540 535 2627
515 817 2628
79 512 2629
766 334 2630
522 656 2631
685 79 2632
648 1115 2633
1995 344 2634
650 542 2635
521 323 2636
577 540 2637
559 1521 2638
67 680 2639
532 916 2640
73 320 2641
79 658 2642
1680 521 2643
68 68 2644
512 561 2645
971 320 2646
591 322 2647
83 596 2648
1859 1866 2649
2244 1164 2650
89 72 2651
83 527 2652
641 323 2653
521 629 2654
515 1767 2655
88 75 2656
672 515 2657
514 334 2658
1264 2447 2659
1194 611 2660
83 548 2661
729 2343 2662
86 320 2663
616 547 2664
719 799 2665
554 623 2666
74 530 2667
532 65 2668
83 805 2669
77 656 2670
526 1096 2671
1734 576 2672
774 563 2673
515 554 2674
546 68 2675
675 344 2676
975 324 2677
645 779 2678
73 877 2679
869 1257 2680
1534 1208 2681
71 660 2682
1141 333 2683
600 1037 2684
69 331 2685
522 324 2686
521 320 2687
1387 579 2688
2380 1376 2689
569 1108 2690
512 334 2691
31 318 2692
557 331 2693
1372 671 2694
524 796 2695
561 566 2696
73 328 2697
950 1886 2698
845 710 2699
635 725 2700
728 351 2701
69 344 2702
1675 648 2703
514 326 2704
2028 330 2705
1602 894 2706
79 569 2707
1178 2462 2708
641 646 2709
83 727 2710
79 877 2711
72 583 2712
2507 322 2713
2311 2324 2714
643 83 2715
2278 2347 2716
1723 323 2717
831 338 2718
644 1447 2719
1045 353 2720
69 581 2721
65 538 2722
1159 330 2723
67 884 2724
82 572 2725
1198 912 2726
714 630 2727
64 335 2728
765 545 2729
558 248 2730
1967 1609 2731
529 68 2732
707 981 2733
834 563 2734
2309 634 2735
66 718 2736
644 2338 2737
606 2226 2738
535 68 2739
577 67 2740
2557 696 2741
524 710 2742
67 322 2743
524 991 2744
522 320 2745
68 744 2746
561 680 2747
70 569 2748
651 516 2749
76 582 2750
845 786 2751
689 632 2752
636 646 2753
741 2163 2754
887 1809 2755
1099 1181 2756
701 630 2757
922 799 2758
69 1061 2759
993 775 2760
1639 762 2761
689 524 2762
803 72 2763
82 332 2764
587 330 2765
67 523 2766
561 1649 2767
68 2664 2768
517 72 2769
582 323 2770
82 528 2771
75 1527 2772
1667 99 2773
647 87 2774
1276 84 2775
932 567 2776
65 550 2777
69 526 2778
1721 2282 2779
1352 67 2780
1613 342 2781
1130 1145 2782
617 563 2783
534 680 2784
514 526 2785
2369 1008 2786
521 70 2787
560 86 2788
1317 517 2789
792 74 2790
65 546 2791
1054 546 2792
1004 765 2793
1831 1660 2794
81 334 2795
676 517 2796
561 85 2797
86 562 2798
79 591 2799
69 320 2800
76 1336 2801
1884 528 2802
828 519 2803
66 338 2804
158 225 2805
2200 656 2806
648 1702 2807
68 1138 2808
76 520 2809
82 594 2810
1 269 2811
1244 538 2812
2367 325 2813
1738 796 2814
554 903 2815
64 322 2816
540 1366 2817
617 65 2818
809 332 2819
664 868 2820
745 543 2821
78 334 2822
88 77 2823
752 942 2824
74 544 2825
555 566 2826
766 733 2827
824 74 2828
2336 773 2829
717 78 2830
79 929 2831
1383 322 2832
69 596 2833
549 680 2834
30 256 2835
2073 2742 2836
1075 88 2837
803 563 2838
598 625 2839
609 338 2840
648 512 2841
1156 1034 2842
532 337 2843
74 527 2844
72 89 2845
513 991 2846
606 588 2847
76 332 2848
778 742 2849
1419 542 2850
606 83 2851
628 335 2852
701 538 2853
1004 79 2854
1966 777 2855
554 711 2856
66 835 2857
908 338 2858
2773 287 2859
65 562 2860
595 538 2861
1819 519 2862
617 2003 2863
529 320 2864
70 579 2865
927 757 2866
2414 710 2867
673 736 2868
645 629 2869
78 958 2870
699 890 2871
552 84 2872
925 1026 2873
572 86 2874
567 66 2875
940 690 2876
1004 335 2877
2093 575 2878
969 512 2879
74 612 2880
1385 621 2881
1162 68 2882
1870 570 2883
517 1158 2884
1006 1093 2885
65 660 2886
691 324 2887
672 344 2888
596 78 2889
512 2264 2890
643 88 2891
546 2194 2892
79 543 2893
617 839 2894
522 864 2895
711 537 2896
69 528 2897
716 662 2898
616 564 2899
766 324 2900
774 623 2901
1189 529 2902
570 1008 2903
572 1527 2904
2399 694 2905
850 1921 2906
587 564 2907
1391 339 2908
572 907 2909
66 775 2910
672 320 2911
512 1145 2912
1333 323 2913
2020 523 2914
978 1757 2915
2370 324 2916
700 324 2917
1667 358 2918
69 737 2919
522 344 2920
645 339 2921
724 597 2922
595 333 2923
643 1178 2924
580 1516 2925
521 344 2926
647 88 2927
526 323 2928
754 572 2929
561 617 2930
534 1287 2931
610 2167 2932
594 334 2933
65 727 2934
2703 1561 2935
76 671 2936
82 340 2937
1101 513 2938
2914 1415 2939
1219 856 2940
1591 528 2941
609 67 2942
2545 1116 2943
572 569 2944
1022 333 2945
79 529 2946
0 257 2947
577 73 2948
709 548 2949
1990 339 2950
701 515 2951
784 88 2952
64 662 2953
573 1947 2954
2375 769 2955
828 528 2956
826 320 2957
549 590 2958
526 659 2959
514 619 2960
1193 646 2961
668 255 2962
524 704 2963
81 520 2964
2708 654 2965
79 538 2966
512 1149 2967
552 1454 2968
573 78 2969
712 550 2970
71 334 2971
772 618 2972
598 522 2973
1191 854 2974
821 849 2975
66 66 2976
77 516 2977
540 1999 2978
1189 1257 2979
86 528 2980
77 547 2981
75 334 2982
714 1353 2983
960 687 2984
78 331 2985
555 918 2986
561 65 2987
29 285 2988
571 891 2989
82 328 2990
709 537 2991
813 519 2992
677 809 2993
553 654 2994
72 736 2995
2125 324 2996
1147 576 2997
698 331 2998
512 1046 2999
603 331 3000
67 1326 3001
608 13 3002
516 890 3003
522 527 3004
552 1019 3005
523 519 3006
1000 701 3007
866 564 3008
639 66 3009
65 529 3010
70 813 3011
65 547 3012
72 515 3013
567 944 3014
67 1104 3015
1428 354 3016
815 945 3017
571 536 3018
583 694 3019
668 488 3020
661 804 3021
659 677 3022
1103 320 3023
596 1787 3024
543 664 3025
73 521 3026
666 1694 3027
924 609 3028
76 542 3029
1222 612 3030
778 582 3031
729 339 3032
66 596 3033
1869 1554 3034
65 328 3035
605 338 3036
644 617 3037
844 68 3038
514 710 3039
535 334 3040
965 529 3041
1481 634 3042
828 320 3043
1442 323 3044
2408 519 3045
666 78 3046
82 658 3047
2438 2940 3048
1261 339 3049
617 743 3050
514 324 3051
79 945 3052
2130 1322 3053
676 338 3054
882 579 3055
771 2850 3056
79 334 3057
709 672 3058
553 542 3059
560 1429 3060
2050 528 3061
843 1104 3062
561 66 3063
920 330 3064
548 328 3065
2228 339 3066
760 563 3067
619 879 3068
67 597 3069
83 756 3070
1647 724 3071
72 326 3072
554 1259 3073
819 528 3074
909 88 3075
2805 352 3076
81 551 3077
2405 1492 3078
86 658 3079
82 67 3080
546 939 3081
837 499 3082
916 344 3083
540 544 3084
2213 517 3085
2141 694 3086
549 338 3087
522 569 3088
2599 1659 3089
77 587 3090
577 337 3091
65 543 3092
2136 320 3093
848 324 3094
1541 542 3095
1537 325 3096
2052 338 3097
697 320 3098
529 747 3099
1297 1931 3100
1687 796 3101
1482 757 3102
600 534 3103
608 678 3104
993 590 3105
765 737 3106
86 1589 3107
591 918 3108
749 2079 3109
831 639 3110
1355 727 3111
517 339 3112
2974 715 3113
659 996 3114
515 673 3115
65 66 3116
2555 566 3117
68 690 3118
77 566 3119
514 555 3120
522 532 3121
83 733 3122
858 907 3123
156 97 3124
85 546 3125
2317 526 3126
701 563 3127
559 512 3128
673 777 3129
84 756 3130
624 611 3131
908 517 3132
516 607 3133
2521 1059 3134
2030 632 3135
1214 1066 3136
1160 333 3137
1192 86 3138
76 81 3139
754 541 3140
521 531 3141
901 330 3142
1321 625 3143
1377 330 3144
83 546 3145
2060 775 3146
529 694 3147
950 1925 3148
2351 777 3149
570 68 3150
553 611 3151
89 519 3152
754 323 3153
69 636 3154
858 1521 3155
807 656 3156
927 743 3157
64 1375 3158
552 544 3159
1213 532 3160
535 769 3161
67 627 3162
872 1369 3163
603 562 3164
64 87 3165
587 567 3166
72 78 3167
86 515 3168
2470 551 3169
540 1168 3170
2610 545 3171
712 527 3172
555 814 3173
588 72 3174
845 723 3175
68 2333 3176
549 707 3177
714 618 3178
1464 86 3179
602 515 3180
86 86 3181
552 594 3182
617 1835 3183
820 654 3184
985 1373 3185
547 326 3186
85 516 3187
561 735 3188
605 70 3189
73 732 3190
1428 98 3191
83 323 3192
2793 2326 3193
1410 538 3194
515 1842 3195
622 79 3196
83 85 3197
534 722 3198
74 595 3199
1756 1059 3200
82 675 3201
2049 324 3202
1338 572 3203
512 2510 3204
554 542 3205
928 868 3206
77 339 3207
570 2607 3208
552 523 3209
714 87 3210
517 78 3211
567 79 3212
613 87 3213
1751 519 3214
554 673 3215
515 771 3216
622 654 3217
70 565 3218
82 322 3219
1352 323 3220
75 569 3221
71 738 3222
1261 83 3223
778 743 3224
1484 667 3225
1083 67 3226
752 69 3227
69 597 3228
557 843 3229
782 691 3230
752 530 3231
577 643 3232
82 596 3233
571 88 3234
564 1298 3235
1328 528 3236
976 662 3237
68 340 3238
549 70 3239
898 343 3240
1747 3068 3241
534 690 3242
534 590 3243
1090 955 3244
1152 1322 3245
578 756 3246
554 1003 3247
69 681 3248
549 1102 3249
567 624 3250
561 76 3251
73 72 3252
759 66 3253
71 896 3254
639 1345 3255
77 328 3256
158 252 3257
2246 563 3258
1281 1418 3259
1465 1490 3260
659 712 3261
823 814 3262
1730 756 3263
972 72 3264
689 527 3265
1379 2669 3266
73 725 3267
532 66 3268
1867 67 3269
955 85 3270
892 528 3271
1541 324 3272
624 1015 3273
600 320 3274
622 972 3275
892 535 3276
86 826 3277
70 576 3278
82 536 3279
71 71 3280
1562 640 3281
78 87 3282
30 257 3283
76 339 3284
714 343 3285
70 326 3286
67 579 3287
2775 1406 3288
1354 323 3289
2206 1953 3290
2178 674 3291
2263 810 3292
617 525 3293
867 326 3294
650 938 3295
2549 710 3296
524 68 3297
1302 826 3298
543 519 3299
1415 324 3300
88 538 3301
70 671 3302
76 529 3303
1851 951 3304
683 324 3305
71 2512 3306
69 321 3307
764 655 3308
598 2142 3309
1374 534 3310
1666 66 3311
915 67 3312
1523 632 3313
70 612 3314
2101 86 3315
70 542 3316
65 83 3317
2298 2245 3318
1830 2057 3319
835 545 3320
650 566 3321
1079 687 3322
88 544 3323
64 603 3324
948 879 3325
78 1959 3326
82 848 3327
1135 860 3328
921 323 3329
68 663 3330
76 530 3331
635 334 3332
75 339 3333
73 550 3334
732 79 3335
553 1259 3336
552 320 3337
523 1822 3338
1784 1406 3339
516 320 3340
532 865 3341
3111 802 3342
983 881 3343
544 611 3344
79 551 3345
811 338 3346
76 715 3347
795 335 3348
2243 3122 3349
2948 541 3350
71 883 3351
668 502 3352
77 525 3353
85 1221 3354
1035 855 3355
1343 569 3356
570 320 3357
72 912 3358
2458 3099 3359
79 967 3360
67 82 3361
513 344 3362
869 552 3363
2055 1988 3364
932 326 3365
2372 331 3366
544 554 3367
69 559 3368
514 1220 3369
67 954 3370
88 84 3371
81 525 3372
562 320 3373
70 512 3374
1084 512 3375
554 322 3376
1368 1619 3377
588 516 3378
70 525 3379
798 671 3380
66 83 3381
1372 1074 3382
561 1117 3383
68 536 3384
600 324 3385
947 733 3386
1494 335 3387
1301 529 3388
527 1127 3389
1363 2903 3390
69 83 3391
86 595 3392
532 75 3393
782 654 3394
1058 543 3395
628 2514 3396
515 679 3397
86 587 3398
3227 2059 3399
2299 550 3400
523 70 3401
1279 541 3402
2056 601 3403
723 84 3404
1548 354 3405
2901 744 3406
515 337 3407
65 602 3408
908 1778 3409
1602 2134 3410
515 700 3411
819 320 3412
77 722 3413
532 579 3414
1057 2498 3415
1711 339 3416
1192 632 3417
1254 542 3418
571 522 3419
79 725 3420
82 530 3421
555 324 3422
866 1197 3423
968 1167 3424
554 867 3425
595 519 3426
73 658 3427
909 328 3428
2643 1158 3429
546 1835 3430
572 1862 3431
1222 538 3432
88 88 3433
755 833 3434
526 78 3435
955 654 3436
82 81 3437
765 848 3438
664 87 3439
1090 603 3440
916 538 3441
68 590 3442
1327 754 3443
2518 2492 3444
699 533 3445
714 840 3446
71 527 3447
1585 566 3448
526 320 3449
613 550 3450
2818 989 3451
524 320 3452
512 564 3453
69 2013 3454
1337 1829 3455
83 602 3456
2883 1059 3457
515 2105 3458
127 102 3459
1381 2865 3460
2919 634 3461
798 342 3462
1296 549 3463
835 550 3464
73 854 3465
540 528 3466
1556 667 3467
1062 513 3468
1035 2354 3469
2776 1069 3470
66 702 3471
2377 1108 3472
1964 519 3473
882 2037 3474
1055 640 3475
74 582 3476
673 1034 3477
86 538 3478
79 740 3479
70 538 3480
1566 2925 3481
1082 1540 3482
66 337 3483
524 1678 3484
1275 563 3485
2179 323 3486
858 1304 3487
867 913 3488
628 522 3489
978 989 3490
927 594 3491
522 992 3492
1129 528 3493
613 885 3494
535 344 3495
700 333 3496
88 334 3497
577 881 3498
1039 326 3499
1545 646 3500
697 324 3501
14 270 3502
1107 525 3503
2318 1061 3504
1915 2033 3505
3208 339 3506
548 519 3507
71 543 3508
78 685 3509
703 1176 3510
1341 338 3511
524 1790 3512
2493 2236 3513
2115 1102 3514
1124 542 3515
1597 2995 3516
659 841 3517
571 333 3518
2856 856 3519
647 971 3520
548 79 3521
795 745 3522
2036 1393 3523
65 883 3524
76 82 3525
2857 645 3526
83 896 3527
2407 579 3528
65 321 3529
2627 1468 3530
1508 357 3531
807 992 3532
552 328 3533
561 685 3534
12 264 3535
594 323 3536
572 65 3537
73 1575 3538
1211 806 3539
2509 579 3540
653 528 3541
522 884 3542
571 331 3543
565 320 3544
515 665 3545
1328 612 3546
628 83 3547
567 87 3548
71 535 3549
3003 579 3550
848 323 3551
936 884 3552
87 343 3553
659 68 3554
2587 654 3555
3356 600 3556
766 1207 3557
526 328 3558
685 334 3559
1330 590 3560
86 343 3561
2204 324 3562
1343 84 3563
1103 328 3564
71 550 3565
587 1720 3566
1669 519 3567
532 611 3568
1810 881 3569
552 517 3570
512 795 3571
1321 514 3572
2930 1075 3573
628 881 3574
909 530 3575
79 974 3576
644 703 3577
1184 2303 3578
72 548 3579
78 515 3580
512 328 3581
1307 946 3582
628 67 3583
617 903 3584
969 1068 3585
659 1778 3586
610 65 3587
1184 981 3588
69 328 3589
2373 323 3590
595 559 3591
3434 535 3592
67 724 3593
562 1786 3594
1035 973 3595
64 564 3596
540 517 3597
1053 339 3598
3512 521 3599
915 913 3600
70 637 3601
613 1404 3602
1498 910 3603
1770 733 3604
73 337 3605
1098 550 3606
820 873 3607
82 853 3608
83 542 3609
1114 1340 3610
79 566 3611
1909 320 3612
1075 529 3613
669 554 3614
543 528 3615
984 332 3616
969 516 3617
1513 1259 3618
2044 524 3619
939 2998 3620
2999 979 3621
570 538 3622
1891 84 3623
514 328 3624
82 806 3625
554 528 3626
76 75 3627
2008 1271 3628
752 654 3629
831 323 3630
65 658 3631
82 546 3632
1124 344 3633
2235 629 3634
65 542 3635
3401 1326 3636
516 597 3637
1592 710 3638
1021 948 3639
648 326 3640
84 339 3641
561 588 3642
78 542 3643
1991 579 3644
974 76 3645
901 2400 3646
676 524 3647
1087 524 3648
719 1340 3649
553 320 3650
534 1242 3651
1328 2884 3652
1092 1609 3653
1564 635 3654
1214 724 3655
1734 1133 3656
66 1458 3657
1832 566 3658
561 803 3659
691 629 3660
26 264 3661
66 621 3662
1796 1796 3663
1065 1402 3664
628 541 3665
3007 324 3666
776 870 3667
72 525 3668
1189 846 3669
561 341 3670
71 828 3671
3212 600 3672
1877 941 3673
75 855 3674
1852 913 3675
82 621 3676
564 881 3677
685 1459 3678
74 553 3679
578 3477 3680
516 328 3681
1806 629 3682
89 656 3683
711 514 3684
70 724 3685
67 340 3686
75 524 3687
703 82 3688
69 332 3689
2348 530 3690
78 335 3691
68 758 3692
547 68 3693
2983 579 3694
1869 2314 3695
661 652 3696
3623 856 3697
69 664 3698
1773 519 3699
67 722 3700
717 618 3701
1109 375 3702
661 339 3703
1975 339 3704
2611 834 3705
1703 1351 3706
3672 1034 3707
2040 1629 3708
1363 565 3709
89 64 3710
521 1029 3711
666 1068 3712
1244 643 3713
876 1809 3714
1469 529 3715
89 528 3716
3170 576 3717
65 812 3718
82 680 3719
622 1242 3720
549 903 3721
88 612 3722
67 329 3723
1072 832 3724
624 805 3725
82 584 3726
535 662 3727
65 520 3728
3526 3098 3729
82 687 3730
3106 590 3731
517 334 3732
74 2527 3733
745 1971 3734
683 1329 3735
714 709 3736
514 513 3737
68 617 3738
3463 1599 3739
672 517 3740
66 332 3741
2932 1104 3742
68 602 3743
82 2715 3744
588 582 3745
1686 655 3746
3114 1875 3747
882 68 3748
2078 1438 3749
1795 576 3750
645 67 3751
72 334 3752
71 671 3753
84 70 3754
1101 331 3755
1223 334 3756
1720 2746 3757
974 77 3758
700 529 3759
77 71 3760
67 73 3761
587 542 3762
732 679 3763
555 613 3764
980 542 3765
67 323 3766
69 590 3767
1309 585 3768
3088 762 3769
547 338 3770
985 1369 3771
1321 550 3772
1571 339 3773
571 527 3774
515 3709 3775
561 736 3776
524 1604 3777
577 2570 3778
570 78 3779
552 715 3780
700 1509 3781
2145 344 3782
3022 65 3783
809 963 3784
628 755 3785
77 533 3786
544 320 3787
1308 2250 3788
1229 1350 3789
2655 590 3790
82 557 3791
1092 2615 3792
516 67 3793
1833 2834 3794
69 1395 3795
76 566 3796
69 715 3797
79 594 3798
540 84 3799
724 538 3800
71 536 3801
964 237 3802
795 563 3803
73 334 3804
675 74 3805
81 527 3806
65 813 3807
79 322 3808
79 521 3809
65 638 3810
78 554 3811
516 590 3812
587 726 3813
2297 331 3814
1017 725 3815
714 322 3816
561 625 3817
1433 710 3818
524 652 3819
3443 671 3820
711 1086 3821
546 1554 3822
11 257 3823
30 2197 3824
540 688 3825
616 522 3826
83 77 3827
905 652 3828
1263 68 3829
3011 1692 3830
908 79 3831
1636 1557 3832
1328 519 3833
88 1491 3834
3713 1467 3835
86 2160 3836
513 84 3837
62 318 3838
675 553 3839
1709 1117 3840
717 320 3841
540 324 3842
577 323 3843
3335 1393 3844
78 1186 3845
564 337 3846
1255 2693 3847
2039 956 3848
68 588 3849
74 2387 3850
2847 1660 3851
86 559 3852
2128 566 3853
69 338 3854
557 84 3855
666 516 3856
557 88 3857
546 662 3858
540 894 3859
604 344 3860
522 526 3861
527 1273 3862
555 332 3863
3534 1034 3864
81 631 3865
703 1157 3866
798 687 3867
598 897 3868
540 574 3869
697 1413 3870
560 1638 3871
936 1124 3872
2166 550 3873
1354 339 3874
919 2089 3875
931 545 3876
1260 956 3877
1537 1181 3878
648 343 3879
82 2040 3880
82 820 3881
570 774 3882
2391 708 3883
673 344 3884
554 1413 3885
66 77 3886
969 1359 3887
2585 601 3888
602 538 3889
552 520 3890
600 1396 3891
709 514 3892
515 1163 3893
64 320 3894
1562 3308 3895
85 335 3896
741 1544 3897
1830 528 3898
1039 344 3899
798 2524 3900
975 536 3901
577 343 3902
72 74 3903
577 512 3904
70 519 3905
561 594 3906
644 1202 3907
693 1288 3908
159 224 3909
711 672 3910
759 554 3911
712 773 3912
648 2656 3913
1077 75 3914
668 511 3915
1410 621 3916
627 580 3917
2490 805 3918
1313 515 3919
77 565 3920
704 81 3921
602 84 3922
577 335 3923
1057 694 3924
549 1003 3925
707 1003 3926
70 596 3927
89 576 3928
532 2358 3929
616 770 3930
86 864 3931
78 332 3932
1363 512 3933
1004 2072 3934
672 528 3935
1528 801 3936
64 321 3937
772 335 3938
82 896 3939
605 585 3940
1056 674 3941
1918 1190 3942
2808 66 3943
3162 2427 3944
67 1124 3945
1587 530 3946
1899 555 3947
848 67 3948
88 514 3949
1680 525 3950
85 334 3951
648 1041 3952
606 545 3953
771 328 3954
866 1252 3955
515 663 3956
1251 77 3957
735 1061 3958
1233 3325 3959
82 587 3960
3913 541 3961
72 65 3962
644 866 3963
1471 590 3964
2023 1908 3965
3482 1140 3966
1608 881 3967
975 527 3968
1020 621 3969
623 2801 3970
824 640 3971
905 339 3972
673 3549 3973
82 676 3974
617 937 3975
2104 694 3976
2239 322 3977
659 975 3978
1084 967 3979
1193 324 3980
513 2770 3981
79 82 3982
616 1666 3983
685 515 3984
1578 332 3985
1165 487 3986
764 736 3987
964 487 3988
66 1032 3989
64 73 3990
707 324 3991
1975 694 3992
587 1243 3993
3438 2434 3994
548 68 3995
76 321 3996
70 543 3997
1211 566 3998
1653 631 3999
512 1343 4000
1114 342 4001
574 574 4002
1443 1443 4003
2939 696 4004
79 88 4005
68 72 4006
65 590 4007
2043 528 4008
2792 652 4009
2004 825 4010
711 521 4011
1251 1704 4012
540 855 4013
66 519 4014
66 855 4015
67 619 4016
1162 519 4017
2600 320 4018
698 320 4019
3046 756 4020
920 327 4021
650 85 4022
2180 612 4023
588 2155 4024
522 530 4025
3179 640 4026
1109 376 4027
965 517 4028
73 1107 4029
670 332 4030
81 550 4031
82 1097 4032
64 737 4033
66 65 4034
546 1208 4035
754 523 4036
564 339 4037
765 742 4038
540 328 4039
647 342 4040
2892 607 4041
919 323 4042
81 883 4043
613 2066 4044
88 331 4045
546 1420 4046
3907 597 4047
83 634 4048
3229 538 4049
876 68 4050
1327 733 4051
2306 344 4052
1511 550 4053
1173 118 4054
2180 528 4055
85 529 4056
76 333 4057
3454 656 4058
65 819 4059
564 708 4060
557 2712 4061
69 731 4062
651 746 4063
515 617 4064
821 552 4065
653 519 4066
515 69 4067
580 1186 4068
969 520 4069
1013 3036 4070
4024 339 4071
1368 2517 4072
89 542 4073
837 503 4074
2256 1396 4075
644 685 4076
2894 333 4077
644 1554 4078
719 542 4079
798 943 4080
924 322 4081
2049 542 4082
850 324 4083
1017 524 4084
561 767 4085
71 337 4086
77 529 4087
860 70 4088
64 628 4089
68 814 4090
89 84 4091
159 222 4092
564 343 4093
811 646 4094
1193 700 4095
1058 879 4096
2710 3916 4097
567 331 4098
68 2174 4099
88 333 4100
522 521 4101
74 1168 4102
1806 2323 4103
74 548 4104
947 66 4105
3821 773 4106
1011 567 4107
983 2260 4108
984 553 4109
2198 535 4110
606 3657 4111
1424 1558 4112
909 1900 4113
627 999 4114
3201 339 4115
1948 1110 4116
749 344 4117
68 343 4118
700 516 4119
707 673 4120
3688 918 4121
1240 740 4122
526 554 4123
679 690 4124
1945 541 4125
76 322 4126
2423 344 4127
677 76 4128
2542 579 4129
513 523 4130
4054 1173 4131
648 958 4132
664 3083 4133
1440 343 4134
666 802 4135
647 83 4136
834 708 4137
2073 1035 4138
66 850 4139
1185 525 4140
71 812 4141
65 2253 4142
8 281 4143
843 344 4144
2460 339 4145
1471 740 4146
2645 3052 4147
561 623 4148
594 1241 4149
79 337 4150
79 602 4151
571 67 4152
689 1705 4153
1435 530 4154
73 551 4155
558 98 4156
3013 973 4157
515 597 4158
82 323 4159
600 1052 4160
1203 903 4161
644 2949 4162
876 538 4163
754 1622 4164
807 521 4165
127 358 4166
1484 545 4167
158 244 4168
2637 715 4169
622 530 4170
663 516 4171
636 339 4172
717 324 4173
94 1001 4174
817 752 4175
965 525 4176
3168 522 4177
2148 1102 4178
1482 86 4179
2024 522 4180
712 885 4181
546 851 4182
594 676 4183
704 344 4184
515 835 4185
79 335 4186
74 526 4187
1486 951 4188
613 514 4189
650 67 4190
3571 680 4191
514 698 4192
3183 656 4193
587 519 4194
2573 656 4195
1083 1171 4196
2247 1110 4197
2039 661 4198
76 612 4199
2409 344 4200
964 491 4201
623 1698 4202
2496 973 4203
520 583 4204
65 339 4205
647 632 4206
3038 691 4207
876 1196 4208
77 1168 4209
84 736 4210
512 78 4211
68 74 4212
553 2058 4213
937 344 4214
1385 870 4215
65 525 4216
681 70 4217
522 1150 4218
3783 1104 4219
543 78 4220
76 828 4221
711 2253 4222
25 3535 4223
1879 553 4224
610 68 4225
1401 769 4226
1680 708 4227
639 1127 4228
515 79 4229
628 611 4230
659 2483 4231
74 895 4232
3253 1925 4233
1653 680 4234
882 2508 4235
527 320 4236
1132 1661 4237
83 1221 4238
3298 621 4239
668 246 4240
1894 897 4241
811 562 4242
553 335 4243
728 235 4244
782 3977 4245
76 562 4246
1564 740 4247
4202 856 4248
587 708 4249
75 328 4250
570 81 4251
76 83 4252
77 1068 4253
84 605 4254
76 1724 4255
610 1324 4256
1264 1668 4257
851 817 4258
85 328 4259
1478 237 4260
764 1406 4261
570 567 4262
546 698 4263
598 1076 4264
548 846 4265
719 1682 4266
83 660 4267
573 527 4268
1587 742 4269
588 514 4270
4013 611 4271
2890 656 4272
683 344 4273
74 585 4274
1784 2106 4275
1411 1696 4276
745 2076 4277
69 66 4278
515 987 4279
66 760 4280
914 879 4281
77 521 4282
67 883 4283
784 1133 4284
1039 333 4285
79 544 4286
523 3039 4287
67 85 4288
74 1068 4289
940 732 4290
653 1714 4291
745 344 4292
578 341 4293
3583 1970 4294
573 72 4295
697 1259 4296
1055 3626 4297
571 625 4298
572 327 4299
1302 1257 4300
523 320 4301
707 1638 4302
82 549 4303
1858 963 4304
1918 2526 4305
1471 339 4306
583 78 4307
66 67 4308
1482 799 4309
1165 231 4310
1617 1492 4311
1984 632 4312
88 746 4313
72 1951 4314
924 542 4315
86 813 4316
623 321 4317
1076 333 4318
931 640 4319
831 2129 4320
764 515 4321
2363 918 4322
3715 856 4323
2719 332 4324
76 672 4325
639 70 4326
549 632 4327
66 920 4328
950 2486 4329
673 704 4330
3203 710 4331
1 267 4332
88 337 4333
569 326 4334
1067 2928 4335
602 519 4336
921 646 4337
2267 1938 4338
534 82 4339
513 595 4340
1608 525 4341
890 566 4342
1031 576 4343
543 320 4344
668 492 4345
67 594 4346
570 548 4347
2889 563 4348
522 737 4349
554 339 4350
79 582 4351
572 321 4352
898 2736 4353
1319 344 4354
67 565 4355
882 597 4356
82 577 4357
2381 541 4358
546 72 4359
3554 729 4360
2164 512 4361
515 572 4362
2679 825 4363
527 334 4364
3363 2156 4365
1478 234 4366
74 660 4367
3785 1652 4368
685 777 4369
532 594 4370
68 1074 4371
1378 656 4372
85 724 4373
516 515 4374
77 514 4375
729 928 4376
3071 726 4377
523 1462 4378
1475 83 4379
914 339 4380
549 868 4381
2391 525 4382
1203 667 4383
1567 663 4384
521 72 4385
74 1041 4386
79 67 4387
2482 2284 4388
600 736 4389
74 74 4390
64 325 4391
1333 67 4392
82 335 4393
1770 530 4394
524 72 4395
82 2220 4396
89 78 4397
573 529 4398
647 1839 4399
2871 1719 4400
872 762 4401
784 2494 4402
651 536 4403
76 548 4404
960 1396 4405
549 799 4406
782 2042 4407
599 575 4408
1603 519 4409
711 334 4410
1447 1804 4411
603 322 4412
673 2474 4413
71 323 4414
512 762 4415
532 723 4416
672 532 4417
1177 555 4418
84 567 4419
66 529 4420
644 2752 4421
2902 528 4422
647 321 4423
1021 338 4424
1464 1340 4425
65 597 4426
808 1076 4427
659 548 4428
588 621 4429
571 339 4430
663 1423 4431
3234 2636 4432
639 729 4433
594 544 4434
82 69 4435
1368 559 4436
2929 1141 4437
512 322 4438
3270 671 4439
647 536 4440
9 265 4441
89 637 4442
79 560 4443
65 828 4444
580 2066 4445
1740 762 4446
580 2593 4447
2331 542 4448
679 1093 4449
798 1648 4450
1880 333 4451
